app/controllers/bookmarks_controller.rb

  def add_api
    begin
      raise if params[:token] != current_user.token
      @bookmark = current_user.bookmarks.new(:url => params[:url])

      respond_to do |format|
        if @bookmark.save
---
INSERT INTO "bookmarks" ("created_at", "sent", "updated_at", "url", "user_id") VALUES('2009-12-03 20:03:27', 'f', '2009-12-03 20:03:27', 'http://google.com', 1)